## Plan Result (prod_pubsubappgateway - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 4 to destroy.</code></pre>

* Replace
  * module.pubsubappgateway[0].azurerm_application_gateway.ag[0]
  * module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.pubsubappgateway[0].azurerm_public_ip.app_gw[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pubsubappgateway[0].azurerm_application_gateway.ag[0] must be replaced
-/+ resource "azurerm_application_gateway" "ag" {
      - enable_http2                      = false -> null
      - fips_enabled                      = false -> null
      - force_firewall_policy_association = false -> null
      ~ id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub" -> (known after apply)
      ~ name                              = "em-fe-00-prod-agw-pubsub" -> "cft-pubsub00-prod-agw" # forces replacement
      ~ private_endpoint_connection       = [] -> (known after apply)
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (4 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/backendAddressPools/em-icp-webpubsub" -> null
          - ip_addresses = [
              - "10.90.100.50",
            ] -> null
          - name         = "em-icp-webpubsub" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.100.50",
            ]
          + name         = "em-icp-webpubsub"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/backendHttpSettingsCollection/em-icp-webpubsub" -> null
          - name                                = "em-icp-webpubsub" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/probes/em-icp-webpubsub" -> null
          - probe_name                          = "em-icp-webpubsub" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "em-icp-webpubsub"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "em-icp-webpubsub"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }

      ~ frontend_ip_configuration {
          ~ id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/frontendIPConfigurations/appGwPublicFrontendIp" -> (known after apply)
            name                            = "appGwPublicFrontendIp"
          + private_ip_address              = (known after apply)
          + private_link_configuration_id   = (known after apply)
          ~ public_ip_address_id            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/publicIPAddresses/em-pubsub-fe-appgw-prod-pip" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ frontend_ip_configuration {
          ~ id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/frontendIPConfigurations/appGwPrivateFrontendIp" -> (known after apply)
            name                            = "appGwPrivateFrontendIp"
          + private_link_configuration_id   = (known after apply)
            # (5 unchanged attributes hidden)
        }

      - frontend_port {
          - id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/frontendPorts/http" -> null
          - name = "http" -> null
          - port = 80 -> null
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }

      ~ gateway_ip_configuration {
          ~ id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/gatewayIPConfigurations/gateway" -> (known after apply)
            name      = "gateway"
            # (1 unchanged attribute hidden)
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "em-icp-webpubsub.prod.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/httpListeners/em-icp-webpubsub" -> null
          - name                           = "em-icp-webpubsub" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "em-icp-webpubsub.prod.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "em-icp-webpubsub"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (3 unchanged attributes hidden)
        }

      - probe {
          - host                                      = "em-icp-webpubsub.prod.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/probes/em-icp-webpubsub" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "em-icp-webpubsub" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + host                                      = "em-icp-webpubsub.prod.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "em-icp-webpubsub"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/backendAddressPools/em-icp-webpubsub" -> null
          - backend_address_pool_name   = "em-icp-webpubsub" -> null
          - backend_http_settings_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/backendHttpSettingsCollection/em-icp-webpubsub" -> null
          - backend_http_settings_name  = "em-icp-webpubsub" -> null
          - http_listener_id            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/httpListeners/em-icp-webpubsub" -> null
          - http_listener_name          = "em-icp-webpubsub" -> null
          - id                          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/requestRoutingRules/em-icp-webpubsub" -> null
          - name                        = "em-icp-webpubsub" -> null
          - priority                    = 10 -> null
          - rewrite_rule_set_id         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name       = "x_fwded_proto" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "em-icp-webpubsub"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "em-icp-webpubsub"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "em-icp-webpubsub"
          + id                          = (known after apply)
          + name                        = "em-icp-webpubsub"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ rewrite_rule_set {
          ~ id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub/rewriteRuleSets/x_fwded_proto" -> (known after apply)
            name = "x_fwded_proto"

            # (1 unchanged block hidden)
        }

      ~ sku {
          - capacity = 0 -> null
            name     = "WAF_v2"
            # (1 unchanged attribute hidden)
        }

      ~ ssl_policy (known after apply)
      - ssl_policy {
          - cipher_suites        = [] -> null
          - disabled_protocols   = [] -> null
          - policy_name          = "AppGwSslPolicy20150501" -> null
          - policy_type          = "Predefined" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostic_settings[0] must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      ~ id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub|app-gw" -> (known after apply)
      ~ log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)
        name                           = "app-gw"
      ~ target_resource_id             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      ~ enabled_log (known after apply)

      ~ log (known after apply)
      - log {
          - category       = "ApplicationGatewayAccessLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "ApplicationGatewayFirewallLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "ApplicationGatewayPerformanceLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
      ~ id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub|app-gw-storage-account" -> (known after apply)
      ~ log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)
        name                           = "app-gw-storage-account"
      ~ target_resource_id             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/em-fe-00-prod-agw-pubsub" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

      - enabled_log {
          - category       = "ApplicationGatewayAccessLog" -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - enabled_log {
          - category       = "ApplicationGatewayPerformanceLog" -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + enabled_log {
          + category       = "ApplicationGatewayAccessLog"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "ApplicationGatewayPerformanceLog"
            # (1 unchanged attribute hidden)
        }

      ~ log (known after apply)
      - log {
          - category       = "ApplicationGatewayAccessLog" -> null
          - enabled        = true -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "ApplicationGatewayFirewallLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "ApplicationGatewayPerformanceLog" -> null
          - enabled        = true -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.pubsubappgateway[0].azurerm_public_ip.app_gw[0] must be replaced
-/+ resource "azurerm_public_ip" "app_gw" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/publicIPAddresses/em-pubsub-fe-appgw-prod-pip" -> (known after apply)
      ~ ip_address              = "4.159.28.216" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ name                    = "em-pubsub-fe-appgw-prod-pip" -> "cft-pubsub-appgw-prod-pip" # forces replacement
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2372,"Program":"tfcmt","SHA1":"","Target":"prod_pubsubappgateway - TerraformPlanApply","Vars":{}} -->